Documents/ТК_ОптимальноеКоличествоНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ТК_ОптимальноеКоличествоНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТК_ОптимальноеКоличествоНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МодельЗаказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКоличестваЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОкругления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОкругленияКоличества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальныйЗапас</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоДоговоруОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВитринаОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвантПоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ТК_ОптимальноеКоличествоНоменклатуры/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
ПЕРЕМ КэшиПеречислений;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ОптимальноеКоличествоНоменклатуры"));
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКэши()
	КэшМоделейЗаказа = Новый Соответствие;
	Для каждого ЭлементПеречисления Из Метаданные.Перечисления.ВидыКоличестваЗаказа.ЗначенияПеречисления Цикл
		КэшМоделейЗаказа.Вставить(ЭлементПеречисления.Синоним,Перечисления.ВидыКоличестваЗаказа[ЭлементПеречисления.Имя]);
	КонецЦикла;
	
	КэшВариантовОкругления = Новый Соответствие;
	Для каждого ЭлементПеречисления Из Метаданные.Перечисления.ВариантыОкругленияКоличества.ЗначенияПеречисления Цикл
		КэшВариантовОкругления.Вставить(ЭлементПеречисления.Синоним,Перечисления.ВариантыОкругленияКоличества[ЭлементПеречисления.Имя]);
	КонецЦикла;
	
	Возврат Новый Структура("КэшМоделейЗаказа, КэшВариантовОкругления", КэшМоделейЗаказа, КэшВариантовОкругления);
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	КэшиПеречислений = ПолучитьКэши();
	//ЭтоАттика = ЭтоАттика();
	ЭтоАттика = Истина;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//// Конец СтандартныеПодсистемы.Свойства
	
	//ПриЧтенииСозданииНаСервере();
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//// СтандартныеПодсистемы.Свойства 
	//Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
	//    ОбновитьЭлементыДополнительныхРеквизитов();
	//    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	//КонецЕсли;
	//// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	//// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);			
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьСостояниеДокумента();
КонецПроцедуры


#КонецОбласти


#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
	Элемент.ТекстРедактирования, 
	ЭтотОбъект, 
	"Объект.Комментарий");
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущийДляВсех(Команда)
	ИмяКолонки=Элементы.Товары.ТекущийЭлемент.Имя;
	Если ИмяКолонки="ТоварыМодельЗаказа"
		ИЛИ ИмяКолонки="ТоварыВариантОкругления"
		ИЛИ ИмяКолонки="ТоварыМинимальныйОстаток"
		ИЛИ ИмяКолонки="ТоварыМаксимальныйЗапас"
		ИЛИ ИмяКолонки="ТоварыПоДоговоруОстаток"
		ИЛИ ИмяКолонки="ТоварыВитринаОстаток"
		ИЛИ ИмяКолонки="ТоварыКвантПоставки" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Новый Структура ("Команда,ИмяКолонки","УстановитьТекущийДляВсех",Прав(ИмяКолонки,СтрДлина(ИмяКолонки)-СтрДлина("Товары"))));
		ПоказатьВопрос (Оповещение,"Установить текущее значение всем элементам таблицы?"+Символы.ПС+"Данная операция необратима для всего документа!",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Иначе
		ПоказатьПредупреждение(,"Для текущей колонки данная функция не доступна !!!");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Параметры.Команда = "УстановитьТекущийДляВсех" Тогда
		Если Результат = КодВозвратаДиалога.Да Тогда
			//Только при положительном ответе устанавливаем
			ТекущаяСтрока=Элементы.Товары.ТекущиеДанные;
			ТекущееЗначение=ТекущаяСтрока[Параметры.ИмяКолонки];
			Для Каждого СтрокаТЧ ИЗ Объект.Товары Цикл
				СтрокаТЧ[Параметры.ИмяКолонки]=ТекущееЗначение;
			КонецЦикла;
			Модифицированность=Истина;
		КонецЕсли;
	ИначеЕсли Параметры.Команда = "ЗагрузитьИзТабличногоДокумента" Тогда
		Если Результат = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
			Объект.Товары.Очистить();
		КонецЕсли;
		ОткрытьФормуЗагрузкиИзТабличногоДокумента();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	ИмяКолонки = Элемент.ТекущийЭлемент.Имя;
	Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.УстановитьТекущийДляВсех.Видимость = ИмяКолонки="ТоварыМодельЗаказа"
	ИЛИ ИмяКолонки="ТоварыВариантОкругления"
	ИЛИ ИмяКолонки="ТоварыМинимальныйОстаток"
	ИЛИ ИмяКолонки="ТоварыМаксимальныйЗапас"
	ИЛИ ИмяКолонки="ТоварыПоДоговоруОстаток"
	ИЛИ ИмяКолонки="ТоварыВитринаОстаток"
	ИЛИ ИмяКолонки="ТоварыКвантПоставки";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТабличногоДокумента(Команда)
	Если Объект.Товары.Количество() <> 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Новый Структура ("Команда,ИмяКолонки","ЗагрузитьИзТабличногоДокумента","хз"));
		
		ПоказатьВопрос (Оповещение,"Очистить табличную часть?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
	Иначе
		ОткрытьФормуЗагрузкиИзТабличногоДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗагрузкиИзТабличногоДокумента()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоАттика", ЭтоАттика);
	СтруктураПараметров.Вставить("СтруктураКолонок", СформироватьСтруктуруКолонокДляЗаполненияИзExel());
	СтруктураПараметров.Вставить("КэшиПеречислений", КэшиПеречислений);
	СтруктураПараметров.Вставить("ТчТовары", Объект.Товары);
	Оповещение = Новый ОписаниеОповещения("ОкончитьЗагрузкуИзТабличногоДокумента",ЭтотОбъект);
	ОткрытьФорму("Документ.ТК_ОптимальноеКоличествоНоменклатуры.Форма.ФормаЗагрузкиДанныхИзТабДок", СтруктураПараметров, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Функция СформироватьСтруктуруКолонокДляЗаполненияИзExel()
	СтруктураКолонок = Новый Структура();    
	
	СтруктураКолонок.Вставить("ТорговаяПлощадка", 	"ТорговаяПлощадка");
	СтруктураКолонок.Вставить("Номенклатура", 		"Номенклатура");
	СтруктураКолонок.Вставить("МодельЗаказа", 		"МодельЗаказа");
	СтруктураКолонок.Вставить("ВариантОкругления", 	"ВариантОкругления");
	СтруктураКолонок.Вставить("МинимальныйОстаток", "МинимальныйОстаток");
	СтруктураКолонок.Вставить("МаксимальныйЗапас", 	"МаксимальныйЗапас");
	Если ЭтоАттика Тогда
		СтруктураКолонок.Вставить("ПоДоговоруОстаток", 	"ПоДоговоруОстаток");
		СтруктураКолонок.Вставить("ВитринаОстаток", 	"ВитринаОстаток");
		СтруктураКолонок.Вставить("КвантПоставки",	 	"КвантПоставки");
	КонецЕсли;
	Возврат СтруктураКолонок;
КонецФункции

&НаКлиенте
Процедура ОкончитьЗагрузкуИзТабличногоДокумента(Результат,Параметры)	Экспорт
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Каждого строка Из Результат Цикл
			ЗаполнитьЗначенияСвойств(Объект.Товары.Добавить(),строка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоАттика()
	Если ЗначениеНастроекПовтИсп.ПодразделениеПользователя(ПараметрыСеанса.ТекущийПользователь) = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры
